---
kind: type
id: T:Autodesk.Revit.DB.CurveUV
source: html/2d1d9c1f-afb6-fc09-f461-54cf0d511bf0.htm
---
# Autodesk.Revit.DB.CurveUV

A class that encapsulates the notion of a curve in the 2D parameter space of a surface in 3D space.

## Syntax (C#)
```csharp
public class CurveUV : IDisposable
```

## Remarks
Revit does not have a class to represent 2D curves explicitly.